// Задача №3. Напишите программу, которая будет выдавать название дня недели по заданному номеру. 3 -> Среда  5 -> Пятница
// 3 -> Среда
// 5 -> Пятница

Console.Clear();
Console.WriteLine("Введите день недели: ");
int number1 = int.Parse(Console.ReadLine())